<a href="https://colab.research.google.com/github/dvisionst/Average_Height_Exercise_Core/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Average Height Exercise Core
- Jose Flores
- 7/6/2022

In [24]:
import pandas as pd
data = '/content/athleteEventsNoPersonal.csv'
athlete_df = pd.read_csv(data)

## 1. Load this dataset and explore it! Answer the following questions:

     a. How many rows?

     b. How many columns?

In [17]:
# a. How many rows?
# b. How many columns?
athlete_df.shape

# a. There are 40616 rows in the dataframe.
# b. There are 12 rows in the dataframe.

(40616, 12)

     c. Which columns have missing values? (Why do think there are there so many null values in the Medals column?)

In [18]:
athlete_df.isna().sum()

# c. The columns with missing values are the 'Age' (1473), 'Height'(9001), 
# and 'Medal'(34699) columns.
# The reason there are so many missing values in the Medals column is because
# in the Olypmic games for any particular sport only 3 medals are given out.
# It will always be the case that there will be more athletes competeing in an
# event than there are medals to win in said event.

ID            0
Age        1473
Height     9001
Team          0
NOC           0
Games         0
Year          0
Season        0
City          0
Sport         0
Event         0
Medal     34699
dtype: int64

     d. How many entries correspond to the city of London?

In [31]:
lon_fill = athlete_df['City'] == 'London'
len(athlete_df[lon_fill])

# d. There are 3370 entries that correspond to London.

3370


     e. What age is the youngest athlete in our sample data?  Hint: use min()

In [32]:
athlete_df['Age'].min()

# e. Eleven years old is the age of youngest athlete in the data set.

11.0

## 2. Create filters to find out:

     a. How many athletes who participated in the Sport "Tug-Of-War" were from Team "Sweden" in our sample dataset?

In [34]:
tug_fill = athlete_df['Sport'] == 'Tug-Of-War'
team_sw_fill = athlete_df['Team'] == 'Sweden'
len(athlete_df[tug_fill & team_sw_fill])

# a. There are six athletes from team Sweden that participated in "Tug-Of-War".

6

     b. How many Gold medals were awarded to athletes who were over 40 years old?

In [40]:
medals_fill = athlete_df['Medal'].isna()
over_40_fill = athlete_df['Age'] > 40
len(athlete_df[~medals_fill & over_40_fill])

# b. There are 178 athletes that were over 40 years old and awarded a medal.

178

## 3. Determine the average height if

     a. All rows are included.

In [42]:
athlete_df['Age'].mean().round(2)

# a. The average age with all rows included is 25.62

25.62

     b. All rows are included but grouped by Event.

In [44]:
athlete_df.groupby('Event')['Age'].mean().round(2)

Event
Alpine Skiing Men's Combined                      24.20
Alpine Skiing Men's Downhill                      24.21
Alpine Skiing Men's Giant Slalom                  23.38
Alpine Skiing Men's Slalom                        23.14
Alpine Skiing Men's Super G                       24.40
                                                  ...
Wrestling Women's Flyweight, Freestyle            25.20
Wrestling Women's Heavyweight, Freestyle          25.33
Wrestling Women's Light-Heavyweight, Freestyle    24.50
Wrestling Women's Lightweight, Freestyle          23.67
Wrestling Women's Middleweight, Freestyle         25.07
Name: Age, Length: 726, dtype: float64

  c. Bonus: This dataset contains many athletes more than once (if they competed in multiple events and/or multiple years). You can confirm this by finding  .value_counts on the ID column!  For the bonus task we want to get the average height of all  the athletes, but don't want to include any athlete more than once.  Hint: We learned how to drop duplicates if EVERY column was identical, but now we want to drop a row any time just the ID is repeated.  To do this,  you can use a subset of your data as an argument in the drop_duplicates function.  You can also tell Python which of the duplicates to keep by using the keep argument.

In [47]:
uniq_ath_df = athlete_df.drop_duplicates(subset='ID', keep='first')
uniq_ath_df['Height'].mean().round(2)

176.32